출처: https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

41. Write a Pandas program to convert DataFrame column type from string to datetime.    

    
```
Sample data:    

String Date:    
0 3/11/2000    
1 3/12/2000    
2 3/13/2000    
dtype: object    

Original DataFrame (string to datetime):    
0    
0 2000-03-11    
1 2000-03-12    
2 2000-03-13    
```

In [1]:
import pandas as pd
import numpy as np

se = pd.Series(['3/11/2000','3/12/2000','3/13/2000'])
se

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

In [2]:
df = pd.DataFrame(se)
df[0] = pd.to_datetime(df[0])
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes
None

           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

42. Write a Pandas program to rename a specific column name in a given DataFrame.     

```
Sample data:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    

New DataFrame after renaming second column:    
col1 Column2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    
```

In [3]:
df = pd.DataFrame({'col1':[1, 2, 3],
                   'col2':[4, 5, 6],
                   'col3':[7, 8, 9]})
df = df.rename(columns={'col2':'Column2'})
df

   col1  Column2  col3
0     1        4     7
1     2        5     8
2     3        6     9

    
    
43. Write a Pandas program to get a list of a specified column of a DataFrame.     

```
Sample data:    
Powered by    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    

Col2 of the DataFrame to list:    
[4, 5, 6]    
```

In [4]:
df = pd.DataFrame({'col1':[1, 2, 3],
                   'col2':[4, 5, 6],
                   'col3':[7, 8, 9]})
df['col2'].tolist()

[4, 5, 6]

    
44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.     


Sample Output:    


```
Column1 Column2 Column3    
Index1 0 0.0 0.0    
Index2 0 0.0 0.0    
Index3 0 0.0 0.0    
.........    
Index12 0 0.0 0.0    
Index13 0 0.0 0.0    
Index14 0 0.0 0.0    
Index15 0 0.0 0.0    
```

In [5]:
zero_values = np.zeros((15, 3))
col = ['Column1','Column2','Column3']

index= []
for i in range(1, 16):
    index.append('Index'+str(i))

df = pd.DataFrame(data=zero_values,
                  columns=col,
                  index=index)
df

         Column1  Column2  Column3
Index1       0.0      0.0      0.0
Index2       0.0      0.0      0.0
Index3       0.0      0.0      0.0
Index4       0.0      0.0      0.0
Index5       0.0      0.0      0.0
Index6       0.0      0.0      0.0
Index7       0.0      0.0      0.0
Index8       0.0      0.0      0.0
Index9       0.0      0.0      0.0
Index10      0.0      0.0      0.0
Index11      0.0      0.0      0.0
Index12      0.0      0.0      0.0
Index13      0.0      0.0      0.0
Index14      0.0      0.0      0.0
Index15      0.0      0.0      0.0

    
45. Write a Pandas program to find the row for where the value of a given column is maximum.     


Sample Output:    


```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    

Row where col1 has maximum value:    
4    

Row where col2 has maximum value:  
3    

Row where col3 has maximum value:    
2    
```

In [6]:
df = pd.DataFrame({'col1':[1, 2, 3, 4, 7],
                   'col2':[4, 5, 6, 9, 5],
                   'col3':[7, 8, 12, 1, 11]})
# print("Row where col1 has maximum value: \n", df.index(df.col1.max()))
# print("Row where col2 has maximum value: \n", df.col2.max())

46. Write a Pandas program to check whether a given column is present in a DataFrame or not.     

```
Sample data:    

Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
Col4 is not present in DataFrame.    
Col1 is present in DataFrame.

In [16]:
df = pd.DataFrame({'col1':[1, 2, 3, 4, 7],
                   'col2':[4, 5, 6, 9, 5],
                   'col3':[7, 8, 12, 1, 11]})
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [15]:
a = input()

if a in df.columns:
    print("{} is present in DataFrame".format(a))
else:
    print("{} is not present in DataFrame".format(a))

col4
col4 is not present in DataFrame

47. Write a Pandas program to get the specified row value of a given DataFrame.     


Sample data:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    

Value of Row 1  
col1 1    
col2 4    
col3 7    
Name: 0, dtype: int64    

Value of Row4    
col1 4    
col2 9    
col3 1    
Name: 3, dtype: int64    
```

In [18]:
df = pd.DataFrame({'col1':[1, 2, 3, 4, 7],
                   'col2':[4, 5, 6, 9, 5],
                   'col3':[7, 8, 12, 1, 11]})
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [28]:
def get_row(row_num):
    print("Value of Row{}".format(row_num))
    return pd.Series(df.values[row_num -1], index=df.columns)

get_row(4)

Value of Row4

col1    4
col2    9
col3    1
dtype: int64

In [30]:
print("Value of Row 1")
df.iloc[0]

Value of Row 1

col1    1
col2    4
col3    7
Name: 0, dtype: int64

In [31]:
print("Value of Row 4")
df.iloc[4]

Value of Row 4

col1     7
col2     5
col3    11
Name: 4, dtype: int64

48. Write a Pandas program to get the datatypes of columns of a DataFrame.     


Sample data:    

```
Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
.......    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Data types of the columns of the said DataFrame:    
attempts int64    
name object    
qualify object    
score float64    
dtype: object    
```

In [39]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

49. Write a Pandas program to append data to an empty DataFrame.     

Sample data:    

```
Original DataFrame:    
After appending some data:    
col1 col2    
0 0 0    
1 1 1    
2 2 2    
```

In [44]:
tmp_df = pd.DataFrame()
tmp_df['col1']=[0, 1, 2]
tmp_df['col2']=[0, 1, 2]
tmp_df

   col1  col2
0     0     0
1     1     1
2     2     2

50. Write a Pandas program to sort a given DataFrame by two or more columns.     


Sample data:    

```
Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
........    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Sort the above DataFrame on attempts, name:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
9 1 Jonas yes 19.0    
7 1 Laura no NaN    
6 1 Matthew yes 14.5    
4 2 Emily no 9.0    
2 2 Katherine yes 16.5    
8 2 Kevin no 8.0    
1 3 Dima no 9.0    
3 3 James no NaN    
5 3 Michael yes 20.0    
```

In [52]:
df1 = df.sort_values(by=['attempts', 'name'])
df1[['attempts','name','qualify','score']]

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
9         1      Jonas     yes   19.0
7         1      Laura      no    NaN
6         1    Matthew     yes   14.5
4         2      Emily      no    9.0
2         2  Katherine     yes   16.5
8         2      Kevin      no    8.0
1         3       Dima      no    9.0
3         3      James      no    NaN
5         3    Michael     yes   20.0

51. Write a Pandas program to convert the datatype of a given column (floats to ints).     

Sample data:    

```
Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.50    
1 3 Dima no 9.10    
......    
8 2 Kevin no 8.80    
9 1 Jonas yes 19.13    
Data types of the columns of the said DataFrame:    
attempts int64    
name object    
qualify object    
score float64    
dtype: object    


Now change the Data type of 'score' column from float to int:    
attempts name qualify score    
0 1 Anastasia yes 12    
1 3 Dima no 9    
2 2 Katherine yes 16    
3 3 James no 12    
4 2 Emily no 9    
5 3 Michael yes 20    
6 1 Matthew yes 14    
7 1 Laura no 11    
8 2 Kevin no 8    
9 1 Jonas yes 19    
Data types of the columns of the DataFrame now:    
attempts int64    
name object    
qualify object    
score int64    
dtype: object    
    
```

52. Write a Pandas program to remove infinite values from a given DataFrame.     


Sample data:    

```
Original DataFrame:    
0    
0 1000.000000    
1 2000.000000    
2 3000.000000    
3 -4000.000000    
4 inf    
5 -inf    

Removing infinite values:    
0    
0 1000.0    
1 2000.0    
2 3000.0    
3 -4000.0    
4 NaN    
5 NaN    
```

53. Write a Pandas program to insert a given column at a specific column index in a DataFrame.   

Sample data:    

```
Original DataFrame    
col2 col3    
0 4 7    
1 5 8    
2 6 12    
3 9 1    
4 5 11    

New DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
```

54. Write a Pandas program to convert a given list of lists into a Dataframe.     

Sample data:    

```
Original list of lists:    
[[2, 4], [1, 3]]    

New DataFrame    
col1 col2    
0 2 4    
1 1 3    
```

55. Write a Pandas program to group by the first column and get second column as lists in rows.     

Sample data:    

```
Original DataFrame    
col1 col2    
0 C1 1    
1 C1 2    
2 C2 3    
3 C2 3    
4 C2 4    
5 C3 6    
6 C2 5    

Group on the col1:    
col1    
C1 [1, 2]    
C2 [3, 3, 4, 5]    
C3 [6]    

Name: col2, dtype: object    
```

56. Write a Pandas program to get column index from column name of a given DataFrame.    

Sample Output:    

```
Original DataFrame    

col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
Index of 'col2'    
1    
```

57. Write a Pandas program to count number of columns of a DataFrame.     

Sample Output:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    

Number of columns:    
3    
```

58. Write a Pandas program to select all columns, except one given column in a DataFrame.  

Sample Output:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
All columns except 'col3':    
col1 col2    
0 1 4    
1 2 5    
2 3 6    
3 4 9    
4 7 5    
```

59. Write a Pandas program to get first n records of a DataFrame.     

Sample Output:    


```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 5    
2 3 6 8    
3 4 9 12    
4 7 5 1    
5 11 0 11    
First 3 rows of the said DataFrame':    
col1 col2 col3    
0 1 4 7    
1 2 5 5    
2 3 6 8    
```

60. Write a Pandas program to get last n records of a DataFrame.     

```
Sample Output:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 5    
2 3 6 8    
3 4 9 12    
4 7 5 1    
5 11 0 11    

Last 3 rows of the said DataFrame':    
col1 col2 col3    
3 4 9 12    
4 7 5 1    
5 11 0 11
```